<script setup lang="ts">
import DescriptionCard from "#c/Common/ui/DescriptionCard.vue";

const descriptionList = {
  first: {
    title: "글자수 세기란?",
    desc: "글자수 세기란 주어진 텍스트에서 포함된 글자의 수를 계산하는 작업을 의미합니다. 이것은 일반적으로 텍스트 처리나 문자열 분석과 관련이 있습니다. 글자수를 세는 것은 다양한 목적으로 사용됩니다.\n" +
        '\n' +
        "1. 문서 편집기 및 워드 프로세서: 글자수 세기는 문서의 길이를 파악하거나 글자수 제한을 준수하는 데 도움이 됩니다. 예를 들어, 특정 웹 서비스나 문서 제출 요구 사항에서 허용된 최대 글자수를 지켜야 할 때 유용합니다.\n" +
        '\n' +
        "2. 텍스트 분석: 글자수는 텍스트 데이터의 통계 및 분석에 사용됩니다. 언어 처리 및 자연어 처리 분야에서 중요한 지표 중 하나입니다.\n" +
        '\n' +
        "3. 문자열 처리: 글자수 세기는 문자열을 처리하고 문자열 내부의 글자를 조작하려는 경우에 필요합니다. 예를 들어, 특정 글자 또는 문자열 패턴을 검색하거나 대체하는데 사용될 수 있습니다.\n" +
        '\n' +
        "4. 텍스트 마케팅: 광고, 소셜 미디어, 이메일 등의 마케팅 콘텐츠에서 글자수를 제한하거나 최적화하는 데 활용됩니다.\n" +
        '\n' +
        "글자수 세기는 주로 문자(알파벳, 숫자, 기호 등)의 수를 세는 것을 의미합니다. 이것은 일반적으로 띄어쓰기와 같은 공백 문자를 제외한 문자만을 계산합니다. 글자수를 세는 작업은 다양한 프로그래밍 언어나 텍스트 편집기에서 구현할 수 있으며, 이를 통해 문자열의 길이를 파악하고 분석할 수 있습니다."
  },
  second: {
    title: '유용한 활용법',
    desc: '1. 이력서 (Resume) 작성:\n' +
        '이력서는 일반적으로 길이나 페이지 수에 제한이 있을 수 있으며, 각 섹션의 글자수를 제한하는 경우가 있습니다. 글자수 세기를 활용하여 자신의 경력 요약, 업적 및 기술을 지정된 글자수 내에 맞게 작성할 수 있습니다.\n' +
        '\n' +
        '2. 자기소개서 (자소서) 작성:\n' +
        '자기소개서는 학교 또는 직업 신청서에 첨부되는 글로, 보통 특정 주제 또는 질문에 대한 답변을 포함합니다. 제출해야 하는 글자수에 따라 자기소개서의 길이를 조절하려면 글자수 세기를 활용할 수 있습니다.\n' +
        '\n' +
        '3. 글자수 제한 준수:\n' +
        '많은 학교, 회사 및 웹 서비스에서는 문서의 길이를 제한하는 경우가 많습니다. 글자수 세기를 사용하여 텍스트가 주어진 제한에 맞게 작성되었는지 확인할 수 있습니다.\n' +
        '\n' +
        '4. 키워드 최적화:\n' +
        '특히 자기소개서나 온라인 이력서의 경우, 특정 키워드를 포함하여 자신을 강조하는 것이 중요할 수 있습니다. 글자수 세기를 사용하여 특정 키워드의 빈도를 확인하고 조절할 수 있습니다.\n' +
        '\n' +
        '5. 문서 일관성 유지:\n' +
        '글자수 세기는 문서의 일관성을 유지하는 데 도움이 됩니다. 각 섹션이나 항목에 할당된 글자수를 준수하면서 일관된 형식을 유지할 수 있습니다.\n' +
        '\n' +
        '6. 피드백 요청:\n' +
        '글자수 세기를 사용하여 작성 중인 문서를 다른 사람에게 보내어 리뷰 및 피드백을 요청할 수 있습니다. 피드백을 얻으면 문서를 더 개선할 수 있습니다.'
  }
}
</script>

<template>
  <div>
    <description-card :title="descriptionList.first.title" :desc="descriptionList.first.desc" />
  </div>
  <div>
    <description-card :title="descriptionList.second.title" :desc="descriptionList.second.desc" />
  </div>
</template>